//ARCHPROC PROC GEN=+1,SRCDSN=PROD.DEFAULT.OUTPUT
//*
//* Generic archive PROC — copies a generation of &SRCDSN into the
//* PROD.BILLING.ARCHIVE GDG. Invoked by BILL010J.STEP030.
//*
//COPYSTEP EXEC PGM=IEBGENER
//SYSUT1   DD  DSN=&SRCDSN(&GEN),DISP=SHR
//SYSUT2   DD  DSN=PROD.BILLING.ARCHIVE(&GEN),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(20,5),RLSE),
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//         PEND

